Tekla Open API Reference for Tekla Structures 2025
ObjectTypesFilterExpressions Class
 The ObjectTypesFilterExpressions class contains all the object type filter expressions.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Filtering.Categories.ObjectTypesFilterExpressions
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class ObjectTypesFilterExpressions
Public NotInheritable Class ObjectTypesFilterExpressions
See Also
Reference
Tekla.Structures.Filtering.Categories Namespace